# IsRational Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbsSurfaceData..::..IsRational Property
NurbsSurfaceData Class See Also
---
Tells if the spline is rational or not. If it is true (rational), then the NURBS is a piecewise rational polynomial function. If it is false (non-rational), then the NURBS is a piecewise polynomial function.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsRational { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsRational As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsRational {
	bool get ();
}
```

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace